VV_cases/V1_solver/results/study_v1/runs/001_data_beta05_initial_verification/02_simulations/baseline_medium_Re120/01_openfoam_setup/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

readFields ( U );

expressions
(
    U
    {
        field U;
        create no;
        dimensions [0 1 -1 0 0 0 0];
        expression
        #{ vector
            (
                0.151600000*(1.0 - pow(2.0*pos().y()/0.024000000, 2.0)),
                0.0025*exp(-pow((pos().x()-0.012)/0.010, 2.0) - pow((pos().y()-0.0035)/0.0035, 2.0)),
                0
            )
        #};
    }
);
